new_project.org
#+TITLE: My machine configs
#+TAGS: { fix(b) feat(f) doc(d) chore(c) } to_think(t) 2305 migration(m)
#+PROPERTY: header-args:nix :padline no
#+PROPERTY: header-args:nix+ :comments link
#+PROPERTY: header-args:nix+ :mkdirp t

* Meta -- README

#+begin_src markdown :tangle README.md
This is my set of dotfiles in a single flake. The README contains a high-level description of the outputs and the `project.org` file contains the details and rationalization of implementation.

# Background

I have migrated to using Nix(ideally, NixOS) on all machines that I get my hands on. This repo contains the configurations for the common tools I use across the machines.

Certain components of my config (mostly dealing with passwords and such) are not included in this flake but rather managed through a separate flake called ~private-config~

# Usage

```nix
{
    inputs= {
        monorepo = {
            url = "github:VTimofeenko/monorepo-machine-config";
            inputs = {
                infra.follows = "stub-flake";
                private-config.follows = "stub-flake";
            };
        };
        stub-flake.url = "github:VTimofeenko/stub-flake"; # A completely empty flake
    };
    outputs = inputs@{ ... }:
    {
        # Import modules/overlays from inputs.monorepo. See the rest of README for more details
    };
}
```
#+end_src

* Project TOOD stats :noexport:

#+BEGIN: tagblock :todo ("DONE" "CNCL") :caption done :tags ("fix" "feat" "doc" "chore")
#+caption: done
| fix   | 0 |
| feat  | 0 |
| doc   | 0 |
| chore | 0 |
#+END

#+BEGIN: tagblock :todo t :caption todo :tags ("fix" "feat" "doc" "chore")
#+caption: todo
| fix   |  2 |
| feat  | 10 |
| doc   |  0 |
| chore | 15 |
#+END
* Flake
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

I tend to use ~flake-parts~ as the basis for my flakes with once specific [[(formatter)][formatter]], nixpkgs-fmt.

Flake-parts:
- Makes exposing an overlay really easy ([[https://flake.parts/overlays.html][doc]])
- has an interface to produce multi-system outputs that (IMO) is more clean than flake-utils ([[https://flake.parts/options/flake-parts.html#opt-perSystem][doc]])
- Has a great collection of add-ons ([[https://flake.parts/options/flake-parts.html][doc]])

** Flake intro :noexport:
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

#+begin_src nix
{
  description = "NixOS configuration by Vladimir Timofeenko";
#+end_src

** Inputs
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

#+begin_src nix
  inputs = {
    nixpkgs.url = "nixpkgs/nixos-22.11";
    nixos-hardware.url = "github:NixOS/nixos-hardware/master";
    home-manager.url = "github:rycee/home-manager/release-22.11";
    agenix.url = "github:ryantm/agenix";

    # Theming and stuff
    base16 = {
      url = "github:SenchoPens/base16.nix";
      # One input only
      inputs.nixpkgs.follows = "nixpkgs";
    };

    color_scheme = {
      url = "github:ajlende/base16-atlas-scheme";
      flake = false;
    };
    private-config = {
      url = "git+file:///home/spacecadet/code/private-flake?ref=master";
      # url = "git+ssh://gitea@gitea.srv.vtimofeenko.com/spacecadet/private-flake.git";
      inputs = {
        agenix.follows = "agenix";
        nixpkgs.follows = "nixpkgs";
      };
    };
    my-tmux = {
      url = "github:VTimofeenko/tmux-flake";
      inputs = {
        nixpkgs.follows = "nixpkgs";
        base16.follows = "base16";
        color_scheme.follows = "color_scheme";
      };
    };

    my-nvim-flake.url = "github:VTimofeenko/nvim-flake";

    my-sway-config = {
      url = "git+file:///home/spacecadet/code/sway-flake?ref=master";
      inputs = {
        base16.follows = "base16";
        color-scheme.follows = "color_scheme";
      };
    };
    # nur.url = "github:nix-community/NUR";
    my-doom-config = {
      url = "git+file:///home/spacecadet/code/doom-config";
      # url = "git+ssh://gitea@gitea.srv.vtimofeenko.com/spacecadet/doom-config.git";
    };
    wg-namespace-flake = {
      url = "git+ssh://gitea@gitea.srv.vtimofeenko.com/spacecadet/wireguard-namespace-flake.git";
      inputs.nixpkgs.follows = "nixpkgs";
    };

    infra = {
      url = "git+ssh://gitea@gitea.srv.vtimofeenko.com/spacecadet/infra-hosts.git";
      flake = false;
    };

    hyprland.url = "github:hyprwm/Hyprland";

    # Service that remaps arbitrary keyboard combinations
    xremap-flake.url = "github:xremap/nix-flake";

    devshell.url = "github:numtide/devshell";

  };
#+end_src

*** TODO pin as many inputs to nixpkgs as possible? :chore:to_think:

** Outputs

*** Outputs intro :noexport:
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

#+begin_src nix
  outputs =
    inputs@{ flake-parts
    , private-config
    , self
    , ...
    }:
    flake-parts.lib.mkFlake { inherit inputs; } {
#+end_src

*** Imports
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

#+begin_src nix
      imports = [
        inputs.devshell.flakeModule
      ];
#+end_src

*** Systems setting
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

#+begin_src nix
      systems = [ "x86_64-linux" "aarch64-darwin" ];
#+end_src

*** "perSystem" output
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

perSystem contains the default formatter and a sample of homeManagerConfiguration. The formatter is also used in [[file:.dir-locals.el][.dirs-local.el]] in the process of "compiling" this project.

#+begin_src nix
      perSystem = { config, self', inputs', pkgs, system, ... }: {
        # Per-system attributes can be defined here. The self' and inputs'
        # module parameters provide easy access to attributes of the same
        # system.
#+end_src

**** Formatter
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

#+begin_src nix
        formatter = pkgs.nixpkgs-fmt; # (ref:formatter)
#+end_src

**** homeConfigurations
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

This section contains modules that can be imported into home manager.

#+begin_src nix
        legacyPackages.homeConfigurations =
          let
            /* Create the default homeManagerConfiguration with inherited pkgs.

                  The provided attrset will be merged into the homeManagerConfiguration.

                   Type: mkHmc :: attrset -> home-manger.lib.homeManagerConfiguration

                */
            mkHmc = attrset: inputs.home-manager.lib.homeManagerConfiguration ({ inherit pkgs; } // attrset);
          in
          {
#+end_src

***** Special users
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

****** Deck
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

#+begin_src nix
            deck = mkHmc {
              modules = [
                ./modules/home-manager
                ./modules/home-manager/_perUser/deck.nix
              ];
            };
#+end_src

******* Deck customization
:PROPERTIES:
:header-args:nix+: :tangle modules/home-manager/_perUser/deck.nix
:END:

#+begin_src nix
{ pkgs, lib, config, ... }:
{
  programs.kitty.package = lib.mkForce pkgs.hello; # Workaround for kitty not getting needed opengl on arch
  home.username = "deck";
  home.homeDirectory = "/home/deck";
}
#+end_src

******** TODO [#C] Add nixGL to fix kitty :fix:

https://github.com/guibou/nixGL

****** Vtimofeenko
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

#+begin_src nix
            vtimofeenko = mkHmc {
              modules = [
                ./modules/home-manager/home.nix
                ./modules/home-manager/vim
                ./modules/home-manager/_perUser/vtimofeenko.nix
              ];
            };
#+end_src

******* Vtimofeenko customization
:PROPERTIES:
:header-args:nix+: :tangle modules/home-manager/_perUser/vtimofeenko.nix
:END:

#+begin_src nix
{ pkgs, lib, config, ... }:
{
  programs.kitty = {
    enable = true;
    package = lib.mkForce pkgs.hello; # Not using nix-darwin, no need to manage the app.
    settings = {
      font_family = "JetBrainsMono Nerd Font Mono";
      cursor_blink_interval = "0";
      inactive_text_alpha = "0.85";
      tab_bar_margin_width = 9;
      tab_bar_margin_height = "2 2";
      tab_bar_style = "separator";
      tab_bar_min_tabs = "0";
      tab_separator = ''""'';
      tab_title_template = "{fmt.fg._5c6370}{fmt.bg.default}{fmt.fg._abb2bf}{fmt.bg._5c6370} {title.split()[0]} {fmt.fg._5c6370}{fmt.bg.default} ";
      active_tab_title_template = "{fmt.fg._29b5e8}{fmt.bg.default}{fmt.fg._ffffff}{fmt.bg._29b5e8} {title.split()[0]} {fmt.fg._29b5e8}{fmt.bg.default} ";
      tab_bar_edge = "bottom";
      background_opacity = "0.95";
      dynamic_background_opacity = "yes";
      macos_option_as_alt = "yes";
      macos_thicken_font = "0.75";
      map = "kitty_mod+enter launch --cwd=current";
      background = "#FFFFFF";
      foreground = "#565656";
      selection_background = "none";
      selection_foreground = "none";
      url_color = "#B8B8B8";
      cursor = "none";
      cursor_text_color = "background";
      active_border_color = "#29B5E8";
      inactive_border_color = "#FFFFFF";
      active_tab_background = "#FFFFFF";
      active_tab_foreground = "#565656";
      inactive_tab_background = "#F2F2F2";
      inactive_tab_foreground = "#B8B8B8";
      tab_bar_background = "#F2F2F2";
      color0 = "#FFFFFF";
      color1 = "#D7585D";
      color2 = "#2BA46F";
      color3 = "#FDBE02";
      color4 = "#11567F";
      color5 = "#7D44CF";
      color6 = "#72D3DD";
      color7 = "#565656";
      color8 = "#7F7F7F";
      color9 = "#D7585D";
      color10 = "#2BA46F";
      color11 = "#FDBE02";
      color12 = "#11567F";
      color13 = "#7D44CF";
      color14 = "#72D3DD";
      color15 = "#FFFFFF";
      color16 = "#FF9F36";
      color17 = "#ff00ff";
      color18 = "#F2F2F2";
      color19 = "#29B5E8";
      color20 = "#B8B8B8";
      color21 = "#F2A44E";
    };
  };
  home.username = "vtimofeenko";
  home.homeDirectory = "/Users/vtimofeenko";
}
#+end_src

******** TODO [#C] Merge the default kitty.nix here :chore:

***** home-manager modules

****** homeConfigurations default.nix
:PROPERTIES:
:header-args:nix+: :tangle modules/home-manager/default.nix
:END:

#+begin_src nix
{ ... }:
{
  imports = [
    ./home.nix
    ./vim # (ref:vim-hm-import)
    ./kitty # (ref:kitty-hm-import)
    ./zsh # (ref:zsh-hm-import)
    ./zathura # (ref:zathura-hm-import)
    ./git.nix # (ref:git-hm-import)
    ./packages.nix # (ref:packages-hm-import)
  ];
}
#+end_src

****** home.nix
:PROPERTIES:
:header-args:nix+: :tangle modules/home-manager/home.nix
:END:

This file contains some basic settings that are used across all homeManagerConfigurations.

#+begin_src nix
{ config, pkgs, ... }:
{
  home.stateVersion = "22.11";
  programs.home-manager.enable = true;
}
#+end_src

******* Reference

- Add a per-user package through ~home.packages = [ ... ]~
- Add per-user file:

#+begin_src nix :tangle no
home.file = {
    ".screenrc".text = "foo";
  };
#+end_src

****** Vim
:PROPERTIES:
:header-args:nix+: :tangle modules/home-manager/vim/default.nix
:END:

Having switched to emacs for most of text-based work, I still use neovim for one-off editing stuff in terminal.

The module described in this section should be used by root and human users on my machines as well as on MacOS, thus I am using home manager module as the platform-agnostic way.

Imported [[(vim-hm-import)][here]].

#+begin_src nix
# Home manager module that configures neovim with some plugins
{ pkgs, config, lib, ... }:
{
  programs.neovim = {
    enable = true;
    viAlias = true;
    vimAlias = true;
    vimdiffAlias = true;
    plugins =
      with pkgs.vimPlugins; [
        vim-surround
        vim-commentary
        vim-nix
        delimitMate
      ];
    extraConfig =
      ''
        syntax on

        let mapleader="\<Space>"

        nnoremap <leader>wl <C-w>l
        nnoremap <leader>wk <C-w>k
        nnoremap <leader>wj <C-w>j
        nnoremap <leader>wh <C-w>h

        nnoremap <silent> <leader>ws :split<CR>
        nnoremap <silent> <leader>wv :vsplit<CR>
        " close the _window_, not the buffer
        nnoremap <silent> <leader>wd <C-w>c

        set number relativenumber
        set modelines=1
        set autoindent
        set ignorecase
        set smartcase incsearch
        filetype plugin on

        " cursor shapes in insert/normal modes
        let &t_SI = "\e[6 q"
        let &t_EI = "\e[2 q"
        hi Visual term=bold,reverse cterm=bold,reverse
        set expandtab
        set tabstop=4
        set shiftwidth=4
        set autoread
        autocmd FileType nix setlocal tabstop=2 shiftwidth=2
        autocmd BufWritePost,FileWritePost *.nix silent !nix fmt >/dev/null 2>&1

        set clipboard=unnamed${if pkgs.stdenv.system != "aarch64-darwin" then "plus" else ""}
        set mouse=

        " clear search highlights by hitting ESC
        nnoremap <ESC> :noh<CR>
      '';
  };
}
#+end_src

