new_project.org
****** zsh (home-manager)
:PROPERTIES:
:header-args:nix+: :tangle modules/home-manager/zsh/default.nix
:END:

Imported [[(vim-hm-import)][here]].

*NOTE*: for system-level completions to function correctly, zsh needs:

#+begin_src nix :tangle no
{
  environment.pathsToLink = [ "/share/zsh" ];
}
#+end_src

in system-level config.

#+begin_src nix
# home-manager clone of the original zsh module
{ pkgs, config, lib, ... }:
let
  zshOptionsToSet = [
    "INTERACTIVE_COMMENTS" # allow bash-style comments
    # history
    "BANG_HIST" # enable logging !!-like commands
    "EXTENDED_HISTORY" # Write the history file in the ":start:elapsed;command" format.
    "INC_APPEND_HISTORY" # Write to the history file immediately, not when the shell exits.
    "SHARE_HISTORY" # Share history between all sessions.
    "HIST_EXPIRE_DUPS_FIRST" # Expire duplicate entries first when trimming history.
    "HIST_IGNORE_DUPS" # Don't record an entry that was just recorded again.
    "HIST_IGNORE_ALL_DUPS" # Delete old recorded entry if new entry is a duplicate.
    "HIST_FIND_NO_DUPS" # Do not display a line previously found.
    "HIST_IGNORE_SPACE" # Don't record an entry starting with a space.
    "HIST_SAVE_NO_DUPS" # Don't write duplicate entries in the history file.
    "HIST_REDUCE_BLANKS" # Remove superfluous blanks before recording entry.
    "HIST_VERIFY" # Don't execute immediately upon history expansion.
    "HIST_FCNTL_LOCK" # enable fcntl syscall for saving history
    # cd management
    "AUTO_CD" # automatically cd into directory
  ];
in
{
  home.packages = builtins.attrValues {
    inherit (pkgs) fzf killall bat jq direnv curl wget fd inetutils ripgrep lsof dig unzip htop;
  };
  programs.zsh = {
    enable = true;
    enableAutosuggestions = true;
    enableSyntaxHighlighting = true;
    # NOTE: enabled manually inline
    enableCompletion = false;
    autocd = true;
    defaultKeymap = "viins";
    dotDir = ".config/zsh";
    history = {
      extended = true;
      ignoreDups = true;
      ignorePatterns = [ "rm *" "pkill *" ];
      ignoreSpace = false;
    };
    initExtra =
      /* Turns a list into a single string. */
      builtins.concatStringsSep "\n" (map (x: "setopt ${x}") zshOptionsToSet)
      +
      ''
                  # Enable vim editing of command line
                  ${builtins.readFile ./plugins/01-vim-edit.zsh}
                  # Enable cd +1..9 to go back in dir stack
                  ${builtins.readFile ./plugins/02-cd.zsh}
                  # fzf bindings
                  source ${pkgs.fzf}/share/fzf/key-bindings.zsh

                  # Word Navigation shortcuts
                  bindkey "^A" vi-beginning-of-line
                  bindkey "^E" vi-end-of-line
                  bindkey "^F" end-of-line

                  # ctrl+arrow for word jupming
                  bindkey "^[[1;5C" forward-word
                  bindkey "^[[1;5D" backward-word

                  # alt+f forward a word
                  bindkey "^[f" forward-word
                  # alt+b back a word
                  bindkey "^[b" backward-word
                  # working backspace
                  bindkey -v '^?' backward-delete-char

                  # Use vim keys in tab complete menu
                  zmodload zsh/complist
                  bindkey -M menuselect 'h' vi-backward-char
                  bindkey -M menuselect 'k' vi-up-line-or-history
                  bindkey -M menuselect 'l' vi-forward-char
                  bindkey -M menuselect 'j' vi-down-line-or-history
                  bindkey -M menuselect '^ ' accept-line

                  # Add entry by "+" but do not exit menuselect
                  bindkey -M menuselect "+" accept-and-menu-complete

                  # Enable the completions.
                  # -i argument is used since /nix/store is owned by root:nixbld and compinit complains
                  autoload -U compinit && compinit -C

                  # Color the completions
                  zstyle ':completion:*' matcher-list 'm:{[:lower:][:upper:]}={[:upper:][:lower:]}' 'm:{[:lower:][:upper:]}={[:upper:][:lower:]} l:|=* r:|=*' 'm:{[:lower:][:upper:]}={[:upper:][:l
        ower:]} l:|=* r:|=*' 'm:{[:lower:][:upper:]}={[:upper:][:lower:]} l:|=* r:|=*'
                  zstyle ':completion:*' list-colors ''${(s.:.)LS_COLORS}
                  zstyle ':completion:*' menu select

                  # Automatically escape urls when pasting
                  autoload -Uz url-quote-magic
                  zle -N self-insert url-quote-magic
                  autoload -Uz bracketed-paste-magic
                  zle -N bracketed-paste bracketed-paste-magic

                  # Custom plugins can be quickly loaded if fpath is extended:
                  fpath=(${./plugins} $fpath)
                  # Bookmarks by "@@"
                  autoload -Uz bookmarks.zsh && bookmarks.zsh
                  # Cursor mode block <> beam
                  autoload -Uz cursor_mode.zsh && cursor_mode.zsh

                  # alias that creates the directory and changes into it
                  mkcd(){ mkdir -p "$@" && cd "$@"; }

                  # Using zsh highlighting with long paths (like nix store) can be slow. This fixes it.
                  # found https://gist.github.com/magicdude4eva/2d4748f8ef3e6bf7b1591964c201c1ab
                  pasteinit() {
                    OLD_SELF_INSERT=''${''${(s.:.)widgets[self-insert]}[2,3]}
                    zle -N self-insert url-quote-magic # I wonder if you'd need `.url-quote-magic`?
                  }

                  pastefinish() {
                    zle -N self-insert $OLD_SELF_INSERT
                  }
                  zstyle :bracketed-paste-magic paste-init pasteinit
                  zstyle :bracketed-paste-magic paste-finish pastefinish

                  # Make comments visible on default background
                  ZSH_HIGHLIGHT_STYLES[comment]='none'

                  # Alternative display for when I am in nix shell
                  # Also preserves zsh when entering nix shelll
                  ${pkgs.any-nix-shell}/bin/any-nix-shell zsh --info-right | source /dev/stdin
      ''
      + # set SSH_AUTH_SOCK <=> gpg-agent is enabled in home-manager
      (if config.services ? gpg-agent.enable  # "?" is used so that lack of gpg-agent option does not cause an error
      then
        ''
          if [[ -z "$SSH_AUTH_SOCK" ]]; then
            export SSH_AUTH_SOCK="$(${config.programs.gpg.package}/bin/gpgconf --list-dirs agent-ssh-socket)"
          fi
        ''
      else "");

    shellAliases = {
      e = "$EDITOR";
      nvim = "$EDITOR";
      vim = "$EDITOR";
      ls = "${pkgs.exa}/bin/exa -h --group-directories-first --icons";
      l = "ls";
      ll = "ls -l";
      la = "ls -al";
      ka = "${pkgs.killall}/bin/killall";
      mkd = "mkdir -pv";
      ga = "${pkgs.git}/bin/git add";
      gau = "ga -u";
      grep = "grep --color=auto";
      mv = "mv -v";
      rm = "${pkgs.coreutils}/bin/rm -id";
      vidir = "${pkgs.moreutils}/bin/vidir --verbose";
      ccopy = "${pkgs.wl-clipboard}/bin/wl-copy";
      syu = "systemctl --user";
      cde = "cd /etc/nixos";
      lg = "${pkgs.lazygit}/bin/lazygit";
      # Colorize IP output
      ip = "ip -c";
    };
  };
  programs.direnv = {
    enable = true;
  };
  programs.starship = {
    enable = true;
    enableBashIntegration = false;
    enableFishIntegration = false;
    enableIonIntegration = false;
    enableNushellIntegration = false;
  };
}
#+end_src

******* zsh modules (home-manager)

******** 01-vim-edit (home-manager)

#+begin_src sh :tangle modules/home-manager/zsh/plugins/01-vim-edit.zsh
# vim style editing
bindkey -v

autoload edit-command-line; zle -N edit-command-line
bindkey -M vicmd jk edit-command-line  # jk chord to edit the current line
#+end_src

******** 02-cd (home-manager)

#+begin_src sh :tangle modules/home-manager/zsh/plugins/02-cd.zsh
# File that sets the behavior of cd command
setopt autocd

# dirs stack manipulation
setopt AUTO_PUSHD           # Push the current directory visited on the stack.
setopt PUSHD_IGNORE_DUPS    # Do not store duplicates in the stack.
setopt PUSHD_SILENT         # Do not print the directory stack after

# Enabled cd +X to change directory to somewhere in stack
alias d='dirs -v' # prints stack of directories
for index ({1..9}) alias "$index"="cd +${index}"; unset index
#+end_src

******** bookmarks (home-manager)

#+begin_src sh :tangle modules/home-manager/zsh/plugins/bookmarks.zsh
# -*- sh -*-
autoload is-at-least
# Source: https://github.com/vincentbernat/zshrc/blob/master/rc/bookmarks.zsh
# Changed by Vladimir Timofeenko, changed MARKPATH to local share for persistence

# Handle bookmarks. This uses the static named directories feature of
# zsh. Such directories are declared with `hash -d
# name=directory`. Both prompt expansion and completion know how to
# handle them. We populate the hash with directories.
#
# With autocd, you can just type `~-bookmark`. Since this can be
# cumbersome to type, you can also type `@@` and this will be turned
# into `~-` by ZLE.

is-at-least 4.3.12 && () {
    MARKPATH="${HOME}/.local/share/zsh/bookmarks"

    # Add some static entries
    hash -d log=/var/log
    hash -d doc=/usr/share/doc

    # Populate the hash
    for link ($MARKPATH/*(N@)) {
        hash -d -- -${link:t}=${link:A}
    }

    vbe-insert-bookmark() {
        emulate -L zsh
        LBUFFER=${LBUFFER}"~-"
    }
    zle -N vbe-insert-bookmark
    bindkey '@@' vbe-insert-bookmark

    # Manage bookmarks
    bookmark() {
        [[ -d $MARKPATH ]] || mkdir -p $MARKPATH
        if (( $# == 0 )); then
            # When no arguments are provided, just display existing
            # bookmarks
            for link in $MARKPATH/*(N@); do
                local markname=${(%):-%F{green}${link:t}%f}
                local markpath=${(%):-%F{blue}${link:A}%f}
                printf "%-30s → %s\n" $markname $markpath
            done
        else
            # Otherwise, we may want to add a bookmark or delete an
            # existing one.
            local -a delete
            zparseopts -D d=delete
            if (( $+delete[1] )); then
                # With `-d`, we delete an existing bookmark
                command rm $MARKPATH/$1
            else
                # Otherwise, add a bookmark to the current
                # directory. The first argument is the bookmark
                # name. `.` is special and means the bookmark should
                # be named after the current directory.
                local name=$1
                [[ $name == "." ]] && name=${PWD:t}
                ln -s $PWD $MARKPATH/$name
                hash -d -- -${name}=${PWD}
            fi
        fi
    }
}
#+end_src

******** cursor_mode (home-manager)

#+begin_src sh :tangle modules/home-manager/zsh/plugins/cursor_mode.zsh
cursor_mode() {
    # See https://ttssh2.osdn.jp/manual/4/en/usage/tips/vim.html for cursor shapes
    cursor_block='\e[2 q'

    cursor_beam='\e[6 q'

    function zle-keymap-select {
        if [[ ${KEYMAP} == vicmd ]] ||
            [[ $1 = 'block' ]]; then
            echo -ne $cursor_block
        elif [[ ${KEYMAP} == main ]] ||
            [[ ${KEYMAP} == viins ]] ||
            [[ ${KEYMAP} = '' ]] ||
            [[ $1 = 'beam' ]]; then
            echo -ne $cursor_beam
        fi
    }

    zle-line-init() {
        echo -ne $cursor_beam
    }

    zle -N zle-keymap-select
    zle -N zle-line-init
}

cursor_mode
#+end_src

******* TODO alias where to "wh" to fzf find a binary :feat:
******* TODO Rewrite in literal style :chore:
******* TODO [#C] See if rm -i alias can be adjusted not to display the full rm path :feat:
******* TODO [#C] Add noti for async notifications :feat:

****** Kitty
:PROPERTIES:
:header-args:nix+: :tangle modules/home-manager/kitty/default.nix
:END:

Imported [[(kitty-hm-import)][here]].

#+begin_src nix
{ pkgs, ... }:

{
  programs.kitty = {
    enable = true;
    # theme = "Neopolitan";
    theme = "Doom Vibrant";
    settings = {
      cursor_blink_interval = 0;
      background_opacity = "0.95";
      inactive_text_alpha = "0.85";
      cursor = "none";
      enable_audio_bell = false;
      tab_bar_margin_width = 9;
      tab_bar_margin_height = "2 2";
      tab_bar_style = "separator";
      tab_bar_min_tabs = 2;
      tab_bar_edge = "bottom";
      tab_title_template = "{fmt.fg.white} {title.split()[0]} ";
      active_tab_title_template = "{fmt.noitalic}{fmt.bg.black}{fmt.fg.white} {title.split()[0]} ";
    };
    keybindings = {
      # Opens a new Kitty window in the current working directory
      "kitty_mod+enter" = "launch --cwd=current";
    };
  };
}
#+end_src

******* TODO [#C] Use custom color scheme :feat:
UI only, low prio

****** Zathura
:PROPERTIES:
:header-args:nix+: :tangle modules/home-manager/zathura/default.nix
:END:

Imported [[(zathura-hm-import)][here]].

#+begin_src nix
# Home-manager module for Zathura
{ ... }: {
  programs.zathura = {
    enable = true;
    options = {
      # Allows zathura to use system clipboard
      selection-clipboard = "clipboard";
    };
  };
}
#+end_src

****** Git
:PROPERTIES:
:header-args:nix+: :tangle modules/home-manager/git.nix
:END:

Home-manager module that configures git for the user.

Imported [[(git-hm-import)][here]].

#+begin_src nix
{ pkgs, ... }: {
  home.packages = builtins.attrValues {
    inherit (pkgs) git lazygit git-crypt;
  };
  programs.git = {
    enable = true;
    aliases = {
      ci = "commit";
      st = "status";
      co = "checkout";
      rv = "remote --verbose";
      unstage = "reset HEAD --";
    };
    userEmail = "id@vtimofeenko.com";
    userName = "Vladimir Timofeenko";
    ignores = [
      # Vim swap files
      "*.swp"
    ];
    extraConfig = {
      url = {
        "https://github.com/" = {
          insteadOf = [
            "gh:"
            "github:"
          ];
        };
      };
    };
  };
}
#+end_src

****** Home-packages
:PROPERTIES:
:header-args:nix+: :tangle modules/home-manager/packages.nix
:END:

A mixed bag of packages that should be installed for home-manager managed users.

Imported [[(packages-hm-import)][here]].

#+begin_src nix
{ pkgs, ... }: {
  home.packages = builtins.attrValues {
    inherit (pkgs) calibre;
  };
}
#+end_src

****** TODO doom module :feat:
****** TODO ideavimrc :feat:
***** homeConfigurations outro :noexport:
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

#+begin_src nix
          };
#+end_src

