new_project.org
****** NixOS user configs
:PROPERTIES:
:header-args:nix+: :tangle modules/user/default.nix
:END:

This file configures my user on the system level and does the basic home-manager configuration.

Imported [[(user-import][here]].

#+begin_src nix
{ pkgs
, config
, lib
, my-doom-config
, ...
}:
{
  users.users.spacecadet = {
    isNormalUser = true;
    extraGroups = [ "wheel" "lp" ];
    shell = pkgs.zsh;
  };

  # TODO: check if still needed
  home-manager.useGlobalPkgs = true;
  home-manager.useUserPackages = true;

  home-manager.users.spacecadet = { ... }: {
    imports = [
      my-doom-config.nixosModules.default
      ../home-manager
    ];
    home.packages = builtins.attrValues {
      inherit (pkgs) ncspot pavucontrol blueman libreoffice firefox brave gthumb;
    };

    programs.browserpass.enable = true;

    programs.password-store = {
      enable = true;
      package = pkgs.pass.withExtensions (exts: [ exts.pass-otp ]);
    };

    home.file.".icons/default".source = "${pkgs.vanilla-dmz}/share/icons/Vanilla-DMZ";
  };
}
#+end_src

******* TODO [#C] See if homeConfiguration can be reused for this :chore:to_think:

******* TODO [#C] Migrate firefox to home-manager management :feat:

******* DONE [#A] Add doom-config :migration:
CLOSED: [2023-05-24 Wed 08:32]

***** Uranium
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

#+begin_src nix
          uranium = inputs.nixpkgs.lib.nixosSystem {
            system = "x86_64-linux";
            modules = [
              ./modules
              ./modules/nixosSystems/uranium # (ref:uranium-import)
              private-config.nixosModules.machines.uranium
              { nixpkgs.overlays = [ inputs.my-sway-config.overlays.default ]; }
            ];
            # NOTE:
            # This makes the inputs propagate into the modules and allows modules to refer to the inputs
            # See network configuration as an example
            specialArgs = inputs;
          };
#+end_src

****** Uranium specific system
:PROPERTIES:
:header-args:nix+: :tangle modules/nixosSystems/uranium/default.nix
:END:

Imported [[(uranium-import)][here]].

#+begin_src nix
{ pkgs
, lib
, config
, my-sway-config
, my-doom-config
, ...
}:
{
  imports = [
    my-sway-config.nixosModules.system
    ../../network/lan-wifi.nix
    # TODO: add optional phone network here commented

    ./hardware # (ref:uranium-hw-import)
  ];
  home-manager.users.spacecadet = { ... }: {
    imports = [
      my-sway-config.nixosModules.default
    ];
    wayland.windowManager.sway.config = {
      # Restore non-vm modifier
      modifier = "Mod4";
      # Output configuration
      output = {
        "eDP-1" = { "scale" = "1"; };
      };
    };
    vt-sway.enableBrightness = true;
  };
}
#+end_src

******* TODO [#A] Add optional phone network commented :migration:

****** Uranium specific hardware
:PROPERTIES:
:header-args:nix+: :tangle modules/nixosSystems/uranium/hardware/default.nix
:END:

Imported [[(uranium-hw-import)][here]].

#+begin_src nix
{ config
, pkgs
, lib
, ...
}:
{
  imports = [
    ./frame.work.nix
  ];
  # Use the systemd-boot EFI boot loader.
  boot.loader.systemd-boot.enable = true;
  boot.loader.efi.canTouchEfiVariables = true;
  boot.tmpOnTmpfs = true;
  boot.tmpOnTmpfsSize = "8G";
  # Modules I want to ensure are there
  boot.initrd.availableKernelModules = [ "thunderbolt" "nvme" "usb_storage" "uas" ];
  boot.initrd.kernelModules = [ ];
  boot.kernelModules = [ "kvm-intel" "coretemp" ];
  boot.extraModulePackages = [ ];
  # Frame.work needs latest kernel for BT and Wi-Fi to work.
  boot.kernelPackages = pkgs.linuxPackages_latest;

  networking.hostName = "uranium";
  networking.useDHCP = false;

  fileSystems."/" =
    {
      device = "/dev/disk/by-uuid/cbaf293c-c8dc-4586-ba65-73cff3f24468";
      fsType = "ext4";
    };
  boot.initrd.luks.gpgSupport = true;

  boot.initrd.luks.devices."luks".device = "/dev/disk/by-uuid/c2e5cd09-b5d7-42cb-a78a-f549edfa0eb4";

  fileSystems."/boot" =
    {
      device = "/dev/disk/by-uuid/028E-BC0A";
      fsType = "vfat";
    };

  swapDevices = [ ];

  # This node was created in 21.11 days
  system.stateVersion = "21.11";

  # For brightness control
  users.users.spacecadet.extraGroups = [ "video" ];
  # bluetooth
  hardware.bluetooth.enable = true;
  services.blueman.enable = true;
  # pipewire config, from https://nixos.wiki/wiki/PipeWire
  security.rtkit.enable = true;
  services.pipewire = {
    enable = true;
    alsa.enable = true;
    alsa.support32Bit = true;
    pulse.enable = true;
    # If you want to use JACK applications, uncomment this
    #jack.enable = true;

    # use the example session manager (no others are packaged yet so this is enabled by default,
    # no need to redefine it in your config for now)
    #media-session.enable = true;
    media-session.config.bluez-monitor.rules = [
      {
        # Matches all cards
        matches = [{ "device.name" = "~bluez_card.*"; }];
        actions = {
          "update-props" = {
            "bluez5.reconnect-profiles" = [ "hfp_hf" "hsp_hs" "a2dp_sink" ];
            # mSBC is not expected to work on all headset + adapter combinations.
            "bluez5.msbc-support" = true;
            # SBC-XQ is not expected to work on all headset + adapter combinations.
            "bluez5.sbc-xq-support" = true;
          };
        };
      }
      {
        matches = [
          # Matches all sources
          { "node.name" = "~bluez_input.*"; }
          # Matches all outputs
          { "node.name" = "~bluez_output.*"; }
        ];
        actions = {
          "node.pause-on-idle" = false;
        };
      }
    ];
  };
  # battery management
  powerManagement = {
    enable = true;
    powertop.enable = true;
    cpuFreqGovernor = lib.mkDefault "powersave";
  };
  services.tlp = {
    enable = true;
    settings = {
      CPU_BOOST_ON_AC = 1;
      CPU_BOOST_ON_BAT = 0;
      CPU_SCALING_GOVERNOR_ON_AC = "performance";
      CPU_SCALING_GOVERNOR_ON_BAT = "powersave";
    };
  };
  # temperature management
  services.thermald.enable = true;
  environment.etc."sysconfig/lm_sensors".text = ''
    # Generated by sensors-detect on Mon Jan  3 23:34:14 2022
    # This file is sourced by /etc/init.d/lm_sensors and defines the modules to
    # be loaded/unloaded.
    #
    # The format of this file is a shell script that simply defines variables:
    # HWMON_MODULES for hardware monitoring driver modules, and optionally
    # BUS_MODULES for any required bus driver module (for example for I2C or SPI).

    HWMON_MODULES="coretemp"
  '';
  # Instead of archwiki, frame.work forums recommend this with s2idle

  # Hardware acceleration
  # Taken from https://nixos.wiki/wiki/Accelerated_Video_Playback
  nixpkgs.config.packageOverrides = pkgs: {
    vaapiIntel = pkgs.vaapiIntel.override { enableHybridCodec = true; };
  };
  hardware.opengl = {
    enable = true;
    extraPackages = with pkgs; [
      intel-media-driver # LIBVA_DRIVER_NAME=iHD
      vaapiIntel # LIBVA_DRIVER_NAME=i965 (older but works better for Firefox/Chromium)
      vaapiVdpau
      libvdpau-va-gl
    ];
  };
  services.fwupd = {
    enable = true;
    extraRemotes = [ "lvfs-testing" ];
  };
  environment.etc."fwupd/uefi_capsule.conf".text = lib.mkForce ''
    [uefi_capsule]
    OverrideESPMountPoint=/boot
    DisableCapsuleUpdateOnDisk=true
  '';
  # NOTE: fwupdmgr uses this to check the boot
  services.udisks2.enable = true;
  # NOTE: Wireless config is here for now, until refactoring of default.nix is done
  systemd.network.links."10-wifi-lan" = {
    matchConfig.PermanentMACAddress = "f8:b5:4d:d7:16:53";
    linkConfig.Name = "wifi-lan";
  };
}
#+end_src

******* Frame.work specific
:PROPERTIES:
:header-args:nix+: :tangle modules/nixosSystems/uranium/hardware/frame.work.nix
:END:

The hardware configuration that was taken from nixos-hardware and slightly tweaked. I am not using deep sleep on this machine as it's very often plugged into the AC power.

#+begin_src nix
{ pkgs
, lib
, config
, nixos-hardware
, ...
}:
{
  imports = [
    nixos-hardware.nixosModules.common-cpu-intel
    nixos-hardware.nixosModules.common-pc-laptop
    nixos-hardware.nixosModules.common-pc-laptop-ssd
  ];
  # high-resolution display
  hardware.video.hidpi.enable = lib.mkDefault true;
  # NOTE: required for wifi to work
  hardware.enableRedistributableFirmware = true;
  hardware.cpu.intel.updateMicrocode = lib.mkDefault config.hardware.enableRedistributableFirmware;
  boot.kernelParams = [
    # For Power consumption
    # https://kvark.github.io/linux/framework/2021/10/17/framework-nixos.html

    # "mem_sleep_default=deep"
    # For Power consumption
    # https://community.frame.work/t/linux-battery-life-tuning/6665/156
    "nvme.noacpi=1"
  ];


  # Fix TRRS headphones missing a mic
  # https://community.frame.work/t/headset-microphone-on-linux/12387/3
  boot.extraModprobeConfig = ''
    options snd-hda-intel model=dell-headset-multi
  '';

  # For fingerprint support
  /* services.fprintd.enable = lib.mkDefault true; */

  # Custom udev rules
  services.udev.extraRules = ''
    # Fix headphone noise when on powersave
    # https://community.frame.work/t/headphone-jack-intermittent-noise/5246/55
    SUBSYSTEM=="pci", ATTR{vendor}=="0x8086", ATTR{device}=="0xa0e0", ATTR{power/control}="on"
    # Ethernet expansion card support
    ACTION=="add", SUBSYSTEM=="usb", ATTR{idVendor}=="0bda", ATTR{idProduct}=="8156", ATTR{power/autosuspend}="20"
  '';

  # Mis-detected by nixos-generate-config
  # https://github.com/NixOS/nixpkgs/issues/171093
  # https://wiki.archlinux.org/title/Framework_Laptop#Changing_the_brightness_of_the_monitor_does_not_work
  hardware.acpilight.enable = lib.mkDefault true;

  # Needed for desktop environments to detect/manage display brightness
  hardware.sensor.iio.enable = lib.mkDefault true;

  # HiDPI
  # Leaving here for documentation
  # hardware.video.hidpi.enable = lib.mkDefault true;

  # Fix font sizes in X
  # services.xserver.dpi = 200;

}
#+end_src

******* TODO [#C] Split this up into more modular things :chore:

***** TODO Neptunium :migration:
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

#+begin_src nix :tangle no
          neptunium = inputs.nixpkgs.lib.nixosSystem {
            system = "x86_64-linux";
            modules = [
              ./modules
              ./modules/nixosSystems/neptunium
              private-config.nixosModules.machines.neptunium
              # { nixpkgs.overlays = [ my-sway-config.overlays.default ]; }
            ];
            # NOTE:
            # This makes the inputs propagate into the modules and allows modules to refer to the inputs
            # See network configuration as an example
            specialArgs = inputs;
          };
#+end_src

****** TODO Neptunium specific system :migration:

****** TODO Neptunium specific hardware :migration:

***** "nixosConfigurations" outro :noexport:
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

#+begin_src nix
        };
#+end_src

**** "Flake" output outro :noexport:
:PROPERTIES:
:header-args:nix+: :tangle flake.nix
:END:

#+begin_src nix
      };
#+end_src

** Flake outro :noexport:

#+begin_src nix
    };
}
#+end_src

* References

- Flake-parts + overlays consumption: https://codeberg.org/adamcstephens/dotfiles/src/commit/310d1f2bcc4518439502310ad927cbf33f8c38ea/flake.nix#L42
- Flake parts config: https://git.sr.ht/~misterio/nix-config/tree/main/item/flake.nix

* Projects

** CI/CD

*** TODO Setup a canary VM :chore:

*** TODO Treefmt :chore:

I have some shell files here -- need to auto format them

*** TODO Checks for org file :chore:
Mostly visual things that annoy me:

- [ ] More than two newlines in a row
- [ ] Hanging newline before end_src
- [ ] Newline has to exist before begin_src
- [ ] No duplicate headlines (messes up detangling)

*** TODO Pre-commit checks :chore:
- [ ] Nix dead code
- [ ] Nix flake check

** Publish
*** TODO [#C] Hugo publish :chore:

** TODO Check all packages that are installed through system.environmentPackages - maybe move them to the user :chore:

** TODO [#C] Consider merging tmux here :feat:
That way I could reuse the configs on other machines

** TODO Figure out TODO export :chore:

Looks like ~tasks~ setting may do the trick:

https://orgmode.org/manual/Export-Settings.html


** STRT Hyprland migration plan [5/8]
At the end of this project I want to have a fully working Hyprland config on neptunium.

*** DONE System-wide settings
*** DONE Base settings
*** DONE Greeter
**** DONE Write
**** DONE Deploy with zsh
**** DONE Evaluate
*** DONE Home-specific settings
*** DONE Xremap base config
*** STRT Cleanup the hyprland module structure -- right now it sits under ~sway/~ which is confusing
*** TODO Revisit packages installed through [home|environment]Packages and see if they can be configured through flake
*** TODO Migrate uranium to hyprland
** TODO Hyprland improvements [0/2]

*** TODO Check out [[https://wiki.hyprland.org/Configuring/Example-configurations/][examples]]

*** TODO [[*EWW -- Widgets][EWW -- Widgets]]

*** TODO Declarative e-mail management

** "Try out this software" stream

This headline serves as a stream of (maybe) cool software that I want to try out, but not right now.

- https://github.com/GyulyVGC/sniffnet

